      * HeaderColumns
       01  HeaderColumns. 
           05  PIC X(4)    value 'Name'.
           05  PIC X(17)   value spaces.
           05  PIC X(4)    value 'Date'.
           05  PIC X(8)    value spaces.
           05  PIC X(12)   value 'Amount'.
