      *Misc fields and indicators
       01  Status_Indicators.
           05  File_Status                             PIC X(2).
       01  Switches                                    PIC X(1).
           88  No_More_Records                         Value High-Values.
       01  Misc_Variables.
           05  Page_Count                              PIC 9(2).